/*********************************************************************************************************************
* 文件名称          display
* 组织名称          东北大学秦皇岛分校 智能车实验室
* 开发环境          MDK-ARM v5.38
* 适用平台          STM32F407VE
********************************************************************************************************************/
#ifndef __DISPLAY_H__
#define __DISPLAY_H__

#include <stdint.h>

void Display_Update(uint8_t current, uint8_t next);  // 刷新 Current/Next 显示

#endif
